/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   fractal_mandelbrot.c                               :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: alkapolly <alkapolly@student.42.fr>        +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/11/30 23:46:58 by alkapolly         #+#    #+#             */
/*   Updated: 2020/12/10 00:25:06 by alkapolly        ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "fractol.h"

/*
** Реальная часть С привязана к оси Х, воображаемая - к оси У
** Отсчет начинаем с -2(слева) до 2(справа) по Х,
** с положительного значения(верх) до -2(низ) по У
** Это учитывается при вычислении С, относящегося к текущей точке
** Точка принадлежит к кругу с радиусом 2, если сумма квадратов
** воображаемой и реальной части ее С меньше или равна pow(радиус, 2),
** т.е. 4
** Формула множества Мандельброта: z0 = С ; z1 = pow(z0, 2) + С
** Квадрат С: pow(a + bi, 2) = pow(a, 2) + 2abi + pow(bi, 2)
** или pow(a, 2) - pow(b, 2) + 2abi
*/

int		mandelbrot(t_mlx *mlx, t_complex c)
{
	int			iter;
	t_complex	z;

	iter = 0;
	z = init_complex(c.re, c.im);
	while (pow(z.re, 2.0) + pow(z.im, 2.0) <= 4 \
		&& iter < mlx->f.max_iter)
	{
		z = complex_power(z, mlx->power);
		z = complex_sum(z, c);
		iter++;
	}
	if (iter >= mlx->f.max_iter && !mlx->nonblack)
		return (-1);
	return (iter);
}
